In [44]:
import pandas as pd
import numpy as np
import mysql.connector
import db_support as db

In [31]:
# Creating a new object called area, which is a database.
area = db.Database_SQL("motorhome_area", "AlumnaAdalab")

In [32]:
# Creating the database
area.create_bbdd()

Connection successful
CMySQLCursor: CREATE DATABASE IF NOT EXISTS motorhome_..

In [33]:
area_table = '''
CREATE TABLE IF NOT EXISTS `area` (
  `id_area` INT NOT NULL AUTO_INCREMENT,
  `latitude` DECIMAL NOT NULL,
  `longitude` DECIMAL NOT NULL,
  `town` VARCHAR (200) NOT NULL,
  `region` VARCHAR (200) NOT NULL,
  `country` VARCHAR (45) NOT NULL,
  `price` VARCHAR (45) NOT NULL,
  `water` VARCHAR (45) NOT NULL,
  `wc` VARCHAR (45) NOT NULL,
  `grey_water` VARCHAR (45) NOT NULL,
  PRIMARY KEY (`id_area`))
  ;'''

In [34]:
temperature_table = '''
CREATE TABLE IF NOT EXISTS `avg_temperature` (
    `id_temp` INT NOT NULL AUTO_INCREMENT,
    `Jan` DECIMAL NOT NULL,
    `Feb` DECIMAL NOT NULL,
    `Mar` DECIMAL NOT NULL,
    `Apr` DECIMAL NOT NULL,
    `May` DECIMAL NOT NULL,
    `Jun` DECIMAL NOT NULL,
    `Jul` DECIMAL NOT NULL,
    `Aug` DECIMAL NOT NULL,
    `Sep` DECIMAL NOT NULL,
    `Oct` DECIMAL NOT NULL,
    `Nov` DECIMAL NOT NULL,
    `Dec` DECIMAL NOT NULL,
    `latitude` DECIMAL NOT NULL,
    `longitude` DECIMAL NOT NULL,
    `town` VARCHAR (200) NOT NULL,
    `country` VARCHAR (45) NOT NULL,
    PRIMARY KEY (`id_temp`),
    CONSTRAINT `fk_temperature_area` 
        FOREIGN KEY (`id_temp`) 
        REFERENCES `area`(`id_area`))
  ;'''

In [35]:
precipitation_table = '''
CREATE TABLE IF NOT EXISTS `avg_precipitation` (
    `id_precip` INT NOT NULL AUTO_INCREMENT,
    `Jan` DECIMAL,
    `Feb` DECIMAL,
    `Mar` DECIMAL,
    `Apr` DECIMAL,
    `May` DECIMAL,
    `Jun` DECIMAL,
    `Jul` DECIMAL,
    `Aug` DECIMAL,
    `Sep` DECIMAL,
    `Oct` DECIMAL,
    `Nov` DECIMAL,
    `Dec` DECIMAL,
    `latitude` DECIMAL NOT NULL,
    `longitude` DECIMAL NOT NULL,
    `town` VARCHAR (200) NOT NULL,
    `country` VARCHAR (45) NOT NULL,
    PRIMARY KEY (`id_precip`),
    CONSTRAINT `fk_precipitation_area` 
        FOREIGN KEY (`id_precip`) 
        REFERENCES `area`(`id_area`))
  ;'''

In [36]:
# Creating the tables with the queries above
area.create_table(area_table)
area.create_table(temperature_table)
area.create_table(precipitation_table)

In [37]:
df = pd.read_csv("../files/03-areas_country.csv", index_col= 0)
df.head(2)

,latitude,longitude,town,region,country,price,water,wc,grey_water
0,39.06956,-0.40980,Carcaixent,Comunitat Valenciana,España,Free,yes,yes,yes
1,42.64159,-8.89696,Boiro,Galicia,España,Free,yes,yes,unknown

In [38]:
# Iterating over rows in the DataFrame
for index, row in df.iterrows():
    # Query to insert data into the table
    query_areas = f"""
    INSERT INTO area (latitude, longitude, town, region, country, price, water, wc, grey_water)
            VALUES ( "{row['latitude']}", "{row['longitude']}", "{row['town']}", "{row['region']}", "{row['country']}", "{row['price']}", "{row['water']}", "{row['wc']}", "{row['grey_water']}");
            """
    area.insert_data(query_areas)

In [39]:
df_temp = pd.read_csv("../files/04-average-temperature.csv", index_col= 0)
df_temp.head(2)

,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,latitude,longitude,town,country
0,11.30,12.66,13.59,15.29,19.32,23.25,26.31,26.63,23.66,19.62,14.99,12.99,39.06956,-0.40980,Carcaixent,España
1,9.67,10.48,12.25,14.01,16.56,19.19,20.99,20.97,19.41,16.36,12.17,10.41,42.64159,-8.89696,Boiro,España

In [40]:
for index, row in df_temp.iterrows():
    query_temperature = f"""
    INSERT INTO `avg_temperature` (`Jan`, `Feb`, `Mar`, `Apr`, `May`, `Jun`, `Jul`, `Aug`, `Sep`, `Oct`, `Nov`, `Dec`, `latitude`, `longitude`, `town`, `country`)
            VALUES  ("{row['Jan']}", "{row['Feb']}", "{row['Mar']}", "{row['Apr']}", "{row['May']}", "{row['Jun']}", "{row['Jul']}", "{row['Aug']}","{row['Sep']}", "{row['Oct']}", "{row['Nov']}","{row['Dec']}","{row['latitude']}","{row['longitude']}","{row['town']}","{row['country']}");
    """
    area.insert_data(query_temperature)

In [45]:
df_prec = pd.read_csv("../files/05-precipitation.csv", index_col= 0)
df_prec.head(2)

,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,latitude,longitude,town,country
0,1.16,0.94,1.65,1.35,1.57,0.89,0.23,0.55,2.35,2.22,2.11,1.19,39.06956,-0.40980,Carcaixent,España
1,6.03,4.46,4.71,4.79,3.13,2.03,1.29,1.64,2.22,7.01,7.07,7.06,42.64159,-8.89696,Boiro,España

In [46]:
df_prec.isnull().sum()

Jan          126
Feb          126
Mar          128
Apr          127
May           13
Jun           13
Jul           13
Aug           13
Sep           13
Oct           13
Nov           13
Dec           13
latitude       0
longitude      0
town           0
country        0
dtype: int64

In [52]:
df_prec2 = df_prec.replace(np.nan, , regex= True)

In [53]:
# Iterating over rows in the DataFrame
for index, row in df_prec2.iterrows():
    query_prec = f"""
    INSERT INTO `avg_precipitation` (`Jan`, `Feb`, `Mar`, `Apr`, `May`, `Jun`, `Jul`, `Aug`, `Sep`, `Oct`, `Nov`, `Dec`, `latitude`, `longitude`, `town`, `country`)
            VALUES ("{row['Jan']}", "{row['Feb']}","{row['Mar']}","{row['Apr']}","{row['May']}","{row['Jun']}","{row['Jul']}","{row['Aug']}","{row['Sep']}","{row['Oct']}","{row['Nov']}","{row['Dec']}", "{row['latitude']}", "{row['longitude']}", "{row['town']}", "{row['country']}");
            """
    area.insert_data(query_prec)

1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Apr' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Apr' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Mar' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Mar' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Mar' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Mar' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000
Message Incorrect decimal value: 'None' for column 'Jan' at row 1
1366 (HY000): Incorrect decimal value: 'None' for column 'Jan' at row 1
Error Code: 1366
SQLSTATE HY000